"""
Хранятся все классы для машины состояний (FSM), для обработки нажатий кнопок.
"""
# ----------------------------------------------------------------------------------------------------------------------
# from aiogram.fsm.context import FSMContext
from aiogram.fsm.state import State, StatesGroup
# ----------------------------------------------------------------------------------------------------------------------

class UserStates(StatesGroup):
    identification = State()  # Состояние ожидания опознания
    select_action = State()  # Состояние выбора действия
    feedback = State()



